In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame([])

In [5]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Catwoman'],
                   "toy": [np.nan, 'Batmobile', 'Bullwhip'],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [6]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [7]:
#0은 행, 1은 열, how=all은 전부 다 null일때, drop
df.dropna(axis=0, how='any')

     name        toy       born
1  Batman  Batmobile 1940-04-25

In [8]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [9]:
df.fillna(0)

       name        toy                 born
0    Alfred          0                    0
1    Batman  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                    0

In [10]:
values = {'name': 0, 'toy': 1, 'born': 2}

In [11]:
df.fillna(value=values)

       name        toy                 born
0    Alfred          1                    2
1    Batman  Batmobile  1940-04-25 00:00:00
2  Catwoman   Bullwhip                    2

In [12]:
df

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT

In [13]:
df.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True

In [14]:
df.notnull()

   name    toy   born
0  True  False  False
1  True   True   True
2  True   True  False

In [16]:
df.isnull().sum()

name    0
toy     1
born    2
dtype: int64

In [20]:
df.notnull().sum()

name    3
toy     2
born    1
dtype: int64